import random
# Напишите программу, которая распечатывает второй элемент листа
fruits = ["apple", "cherry", "orange", "kiwi", "melon", "banana", "mango"]
print(fruits[1])
# Напишите программу, которая распечатывает случайный элемент листа
print(random.choice(fruits))
# Напишите программу, которая распечатывает элементы листа со второго по четвертый включительно
print(fruits[1:5])
# Напишите программу, которая отсортирует лист по алфавиту, после чего заменит "cherry" на "lemon" и распечатает
# новый лист
n_list = sorted(fruits)
n_list[2] = "lemon"
print(n_list)



# Напишите программу, которая добавит элемент "lemon" к листу последним и распечатает новый лист
# new_list = fruits[:]
# new_list.append("lemon")
# print(new_list)
#
# # Lemon 2
# n = fruits[:]
# n.insert(1, "lemon")
# print(n)
#
# # remove banana
# m = fruits[:]
# m.remove("banana")
# print(m)
# print(fruits[7], n_list[6])
# # amount of elements
# print(len(fruits))

if fruits = "orange":
